Revit 2027 API
IFCAggregateIterator Methods
The IFCAggregateIterator type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
MoveNext |  Increments the iterator to the next object in the IFCAggregate.
Reset |  Resets the iterator to the beginning of the aggregate.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace